## Generated SDC file "DE2_115_WEB_SERVER.sdc"

## Copyright (C) 1991-2011 Altera Corporation
## Your use of Altera Corporation's design tools, logic functions 
## and other software and tools, and its AMPP partner logic 
## functions, and any output files from any of the foregoing 
## (including device programming or simulation files), and any 
## associated documentation or information are expressly subject 
## to the terms and conditions of the Altera Program License 
## Subscription Agreement, Altera MegaCore Function License 
## Agreement, or other applicable license agreement, including, 
## without limitation, that your use is for the sole purpose of 
## programming logic devices manufactured by Altera and sold by 
## Altera or its authorized distributors.  Please refer to the 
## applicable agreement for further details.


## VENDOR  "Altera"
## PROGRAM "Quartus II"
## VERSION "Version 10.1 Build 197 01/19/2011 Service Pack 1 SJ Full Version"

## DATE    "Sat Mar 10 22:15:53 2012"

##
## DEVICE  "EP4CE115F29C7"
##


#**************************************************************
# Time Information
#**************************************************************

set_time_format -unit ns -decimal_places 3



#**************************************************************
# Create Clock
#**************************************************************

create_clock -name {altera_reserved_tck} -period 100.000 -waveform { 0.000 50.000 } [get_ports {altera_reserved_tck}]
create_clock -name {CLOCK_50} -period 20.000 -waveform { 0.000 10.000 } [get_ports {CLOCK_50}]
create_clock -name {virtual_camera_clk} -period 10.417 -waveform { 0.000 5.208 } 
create_clock -name {ENET0_RX_CLK} -period 8.000 -waveform { 0.000 4.000 } [get_ports {ENET0_RX_CLK}]


#**************************************************************
# Create Generated Clock
#**************************************************************

create_generated_clock -name {u6|altpll_component|auto_generated|pll1|clk[0]} -source [get_pins {u6|altpll_component|auto_generated|pll1|inclk[0]}] -duty_cycle 50.000 -multiply_by 5 -divide_by 2 -master_clock {CLOCK_50} [get_pins {u6|altpll_component|auto_generated|pll1|clk[0]}] 
create_generated_clock -name {u6|altpll_component|auto_generated|pll1|clk[1]} -source [get_pins {u6|altpll_component|auto_generated|pll1|inclk[0]}] -duty_cycle 50.000 -multiply_by 5 -divide_by 2 -phase -135.000 -master_clock {CLOCK_50} [get_pins {u6|altpll_component|auto_generated|pll1|clk[1]}] 
create_generated_clock -name {u6|altpll_component|auto_generated|pll1|clk[2]} -source [get_pins {u6|altpll_component|auto_generated|pll1|inclk[0]}] -duty_cycle 50.000 -multiply_by 25 -divide_by 52 -master_clock {CLOCK_50} [get_pins {u6|altpll_component|auto_generated|pll1|clk[2]}] 
create_generated_clock -name {u6|altpll_component|auto_generated|pll1|clk[3]} -source [get_pins {u6|altpll_component|auto_generated|pll1|inclk[0]}] -duty_cycle 50.000 -multiply_by 1 -divide_by 2 -master_clock {CLOCK_50} [get_pins {u6|altpll_component|auto_generated|pll1|clk[3]}] 
create_generated_clock -name {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]} -source [get_pins {DE2_115_SOPC_inst|the_pll|sd1|pll7|inclk[0]}] -duty_cycle 50.000 -multiply_by 2 -master_clock {CLOCK_50} [get_pins {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] 
create_generated_clock -name {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]} -source [get_pins {DE2_115_SOPC_inst|the_pll|sd1|pll7|inclk[0]}] -duty_cycle 50.000 -multiply_by 1 -divide_by 5 -master_clock {CLOCK_50} [get_pins {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] 
create_generated_clock -name {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]} -source [get_pins {enet_rx_clk_pll|altpll_component|auto_generated|pll1|inclk[0]}] -duty_cycle 50.000 -multiply_by 1 -master_clock {ENET0_RX_CLK} [get_pins {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] 
create_generated_clock -name {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]} -source [get_pins {enet_rx_clk_pll|altpll_component|auto_generated|pll1|inclk[0]}] -duty_cycle 50.000 -multiply_by 1 -phase 90.000 -master_clock {ENET0_RX_CLK} [get_pins {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] 
create_generated_clock -name {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[2]} -source [get_pins {enet_rx_clk_pll|altpll_component|auto_generated|pll1|inclk[0]}] -duty_cycle 50.000 -multiply_by 1 -phase 180.000 -master_clock {ENET0_RX_CLK} [get_pins {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[2]}] 


#**************************************************************
# Set Clock Latency
#**************************************************************



#**************************************************************
# Set Clock Uncertainty
#**************************************************************

set_clock_uncertainty -rise_from [get_clocks {altera_reserved_tck}] -rise_to [get_clocks {altera_reserved_tck}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {altera_reserved_tck}] -fall_to [get_clocks {altera_reserved_tck}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {altera_reserved_tck}] -rise_to [get_clocks {altera_reserved_tck}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {altera_reserved_tck}] -fall_to [get_clocks {altera_reserved_tck}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {CLOCK_50}] -rise_to [get_clocks {CLOCK_50}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {CLOCK_50}] -fall_to [get_clocks {CLOCK_50}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {CLOCK_50}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -setup 0.070 
set_clock_uncertainty -rise_from [get_clocks {CLOCK_50}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -hold 0.100 
set_clock_uncertainty -rise_from [get_clocks {CLOCK_50}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -setup 0.070 
set_clock_uncertainty -rise_from [get_clocks {CLOCK_50}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -hold 0.100 
set_clock_uncertainty -rise_from [get_clocks {CLOCK_50}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -setup 0.070 
set_clock_uncertainty -rise_from [get_clocks {CLOCK_50}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -hold 0.100 
set_clock_uncertainty -rise_from [get_clocks {CLOCK_50}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -setup 0.070 
set_clock_uncertainty -rise_from [get_clocks {CLOCK_50}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -hold 0.100 
set_clock_uncertainty -rise_from [get_clocks {CLOCK_50}] -rise_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -setup 0.080 
set_clock_uncertainty -rise_from [get_clocks {CLOCK_50}] -rise_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -hold 0.110 
set_clock_uncertainty -rise_from [get_clocks {CLOCK_50}] -fall_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -setup 0.080 
set_clock_uncertainty -rise_from [get_clocks {CLOCK_50}] -fall_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -hold 0.110 
set_clock_uncertainty -rise_from [get_clocks {CLOCK_50}] -rise_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -setup 0.080 
set_clock_uncertainty -rise_from [get_clocks {CLOCK_50}] -rise_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -hold 0.110 
set_clock_uncertainty -rise_from [get_clocks {CLOCK_50}] -fall_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -setup 0.080 
set_clock_uncertainty -rise_from [get_clocks {CLOCK_50}] -fall_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -hold 0.110 
set_clock_uncertainty -fall_from [get_clocks {CLOCK_50}] -rise_to [get_clocks {CLOCK_50}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {CLOCK_50}] -fall_to [get_clocks {CLOCK_50}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {CLOCK_50}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -setup 0.070 
set_clock_uncertainty -fall_from [get_clocks {CLOCK_50}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -hold 0.100 
set_clock_uncertainty -fall_from [get_clocks {CLOCK_50}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -setup 0.070 
set_clock_uncertainty -fall_from [get_clocks {CLOCK_50}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -hold 0.100 
set_clock_uncertainty -fall_from [get_clocks {CLOCK_50}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -setup 0.070 
set_clock_uncertainty -fall_from [get_clocks {CLOCK_50}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -hold 0.100 
set_clock_uncertainty -fall_from [get_clocks {CLOCK_50}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -setup 0.070 
set_clock_uncertainty -fall_from [get_clocks {CLOCK_50}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -hold 0.100 
set_clock_uncertainty -fall_from [get_clocks {CLOCK_50}] -rise_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -setup 0.080 
set_clock_uncertainty -fall_from [get_clocks {CLOCK_50}] -rise_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -hold 0.110 
set_clock_uncertainty -fall_from [get_clocks {CLOCK_50}] -fall_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -setup 0.080 
set_clock_uncertainty -fall_from [get_clocks {CLOCK_50}] -fall_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -hold 0.110 
set_clock_uncertainty -fall_from [get_clocks {CLOCK_50}] -rise_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -setup 0.080 
set_clock_uncertainty -fall_from [get_clocks {CLOCK_50}] -rise_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -hold 0.110 
set_clock_uncertainty -fall_from [get_clocks {CLOCK_50}] -fall_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -setup 0.080 
set_clock_uncertainty -fall_from [get_clocks {CLOCK_50}] -fall_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -hold 0.110 
set_clock_uncertainty -rise_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[0]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[0]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}]  0.150 
set_clock_uncertainty -rise_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}]  0.150 
set_clock_uncertainty -fall_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[0]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[0]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}]  0.150 
set_clock_uncertainty -fall_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}]  0.150 
set_clock_uncertainty -rise_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -rise_to [get_clocks {CLOCK_50}] -setup 0.100 
set_clock_uncertainty -rise_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -rise_to [get_clocks {CLOCK_50}] -hold 0.070 
set_clock_uncertainty -rise_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -fall_to [get_clocks {CLOCK_50}] -setup 0.100 
set_clock_uncertainty -rise_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -fall_to [get_clocks {CLOCK_50}] -hold 0.070 
set_clock_uncertainty -rise_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -rise_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[0]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -fall_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[0]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -rise_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -fall_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -rise_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[3]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -fall_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[3]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}]  0.150 
set_clock_uncertainty -rise_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}]  0.150 
set_clock_uncertainty -fall_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -rise_to [get_clocks {CLOCK_50}] -setup 0.100 
set_clock_uncertainty -fall_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -rise_to [get_clocks {CLOCK_50}] -hold 0.070 
set_clock_uncertainty -fall_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -fall_to [get_clocks {CLOCK_50}] -setup 0.100 
set_clock_uncertainty -fall_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -fall_to [get_clocks {CLOCK_50}] -hold 0.070 
set_clock_uncertainty -fall_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -rise_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[0]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -fall_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[0]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -rise_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -fall_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -rise_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[3]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -fall_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[3]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}]  0.150 
set_clock_uncertainty -fall_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}]  0.150 
set_clock_uncertainty -rise_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[3]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[3]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}]  0.150 
set_clock_uncertainty -rise_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}]  0.150 
set_clock_uncertainty -fall_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[3]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[3]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}]  0.150 
set_clock_uncertainty -fall_from [get_clocks {u6|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}]  0.150 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -rise_to [get_clocks {CLOCK_50}] -setup 0.100 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -rise_to [get_clocks {CLOCK_50}] -hold 0.070 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -fall_to [get_clocks {CLOCK_50}] -setup 0.100 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -fall_to [get_clocks {CLOCK_50}] -hold 0.070 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -rise_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}]  0.150 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -fall_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}]  0.150 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -rise_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}]  0.150 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -fall_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}]  0.150 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -rise_to [get_clocks {CLOCK_50}] -setup 0.100 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -rise_to [get_clocks {CLOCK_50}] -hold 0.070 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -fall_to [get_clocks {CLOCK_50}] -setup 0.100 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -fall_to [get_clocks {CLOCK_50}] -hold 0.070 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -rise_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}]  0.150 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -fall_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}]  0.150 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -rise_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}]  0.150 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}] -fall_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}]  0.150 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -rise_to [get_clocks {CLOCK_50}] -setup 0.100 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -rise_to [get_clocks {CLOCK_50}] -hold 0.070 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -fall_to [get_clocks {CLOCK_50}] -setup 0.100 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -fall_to [get_clocks {CLOCK_50}] -hold 0.070 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -rise_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[0]}]  0.150 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -fall_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[0]}]  0.150 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -rise_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}]  0.150 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -fall_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}]  0.150 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -rise_to [get_clocks {CLOCK_50}] -setup 0.100 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -rise_to [get_clocks {CLOCK_50}] -hold 0.070 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -fall_to [get_clocks {CLOCK_50}] -setup 0.100 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -fall_to [get_clocks {CLOCK_50}] -hold 0.070 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -rise_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[0]}]  0.150 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -fall_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[0]}]  0.150 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -rise_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}]  0.150 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -fall_to [get_clocks {u6|altpll_component|auto_generated|pll1|clk[2]}]  0.150 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[2]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {CLOCK_50}] -setup 0.110 
set_clock_uncertainty -rise_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {CLOCK_50}] -hold 0.080 
set_clock_uncertainty -rise_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {CLOCK_50}] -setup 0.110 
set_clock_uncertainty -rise_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {CLOCK_50}] -hold 0.080 
set_clock_uncertainty -rise_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}]  0.150 
set_clock_uncertainty -rise_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}]  0.150 
set_clock_uncertainty -rise_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {CLOCK_50}] -setup 0.110 
set_clock_uncertainty -fall_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {CLOCK_50}] -hold 0.080 
set_clock_uncertainty -fall_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {CLOCK_50}] -setup 0.110 
set_clock_uncertainty -fall_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {CLOCK_50}] -hold 0.080 
set_clock_uncertainty -fall_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}]  0.150 
set_clock_uncertainty -fall_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}]  0.150 
set_clock_uncertainty -fall_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -rise_to [get_clocks {CLOCK_50}] -setup 0.110 
set_clock_uncertainty -rise_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -rise_to [get_clocks {CLOCK_50}] -hold 0.080 
set_clock_uncertainty -rise_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -fall_to [get_clocks {CLOCK_50}] -setup 0.110 
set_clock_uncertainty -rise_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -fall_to [get_clocks {CLOCK_50}] -hold 0.080 
set_clock_uncertainty -rise_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}]  0.150 
set_clock_uncertainty -rise_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}]  0.150 
set_clock_uncertainty -rise_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -rise_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -fall_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -rise_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}]  0.020 
set_clock_uncertainty -rise_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -fall_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -rise_to [get_clocks {CLOCK_50}] -setup 0.110 
set_clock_uncertainty -fall_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -rise_to [get_clocks {CLOCK_50}] -hold 0.080 
set_clock_uncertainty -fall_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -fall_to [get_clocks {CLOCK_50}] -setup 0.110 
set_clock_uncertainty -fall_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -fall_to [get_clocks {CLOCK_50}] -hold 0.080 
set_clock_uncertainty -fall_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -rise_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}]  0.150 
set_clock_uncertainty -fall_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -fall_to [get_clocks {DE2_115_SOPC_inst|the_pll|sd1|pll7|clk[0]}]  0.150 
set_clock_uncertainty -fall_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -rise_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -fall_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[0]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -rise_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}]  0.020 
set_clock_uncertainty -fall_from [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}] -fall_to [get_clocks {enet_rx_clk_pll|altpll_component|auto_generated|pll1|clk[1]}]  0.020 


#**************************************************************
# Set Input Delay
#**************************************************************

set_input_delay -add_delay -min -clock [get_clocks {ENET0_RX_CLK}]  2.000 [get_ports {ENET0_RX_CLK}]


#**************************************************************
# Set Output Delay
#**************************************************************



#**************************************************************
# Set Clock Groups
#**************************************************************

set_clock_groups -asynchronous -group [get_clocks {altera_reserved_tck}] 
set_clock_groups -asynchronous -group [get_clocks {altera_reserved_tck}] 
set_clock_groups -asynchronous -group [get_clocks {altera_reserved_tck}] 
set_clock_groups -asynchronous -group [get_clocks {altera_reserved_tck}] 
set_clock_groups -asynchronous -group [get_clocks {altera_reserved_tck}] 
set_clock_groups -asynchronous -group [get_clocks {altera_reserved_tck}] 
set_clock_groups -asynchronous -group [get_clocks {altera_reserved_tck}] 
set_clock_groups -asynchronous -group [get_clocks {altera_reserved_tck}] 
set_clock_groups -asynchronous -group [get_clocks {altera_reserved_tck}] 
set_clock_groups -asynchronous -group [get_clocks {altera_reserved_tck}] 
set_clock_groups -asynchronous -group [get_clocks {altera_reserved_tck}] 


#**************************************************************
# Set False Path
#**************************************************************

set_false_path -from [get_keepers {*rdptr_g*}] -to [get_keepers {*ws_dgrp|dffpipe_qd9:dffpipe9|dffe10a*}]
set_false_path -from [get_keepers {*delayed_wrptr_g*}] -to [get_keepers {*rs_dgwp|dffpipe_pd9:dffpipe6|dffe7a*}]
set_false_path -from [get_keepers {*rdptr_g*}] -to [get_keepers {*ws_dgrp|dffpipe_kd9:dffpipe10|dffe11a*}]
set_false_path -from [get_keepers {*delayed_wrptr_g*}] -to [get_keepers {*rs_dgwp|dffpipe_jd9:dffpipe6|dffe7a*}]
set_false_path -from [get_keepers {*rdptr_g*}] -to [get_keepers {*ws_dgrp|dffpipe_re9:dffpipe19|dffe20a*}]
set_false_path -from [get_keepers {*delayed_wrptr_g*}] -to [get_keepers {*rs_dgwp|dffpipe_qe9:dffpipe16|dffe17a*}]
set_false_path -from [get_keepers {altera_reserved_tdi}] -to [get_keepers {pzdyqx*}]
set_false_path -from [get_registers {*|alt_jtag_atlantic:*|jupdate}] -to [get_registers {*|alt_jtag_atlantic:*|jupdate1*}]
set_false_path -from [get_registers {*|alt_jtag_atlantic:*|rdata[*]}] -to [get_registers {*|alt_jtag_atlantic*|td_shift[*]}]
set_false_path -from [get_registers {*|alt_jtag_atlantic:*|read_req}] 
set_false_path -from [get_registers {*|alt_jtag_atlantic:*|read_write}] -to [get_registers {*|alt_jtag_atlantic:*|read_write1*}]
set_false_path -from [get_registers {*|alt_jtag_atlantic:*|rvalid}] -to [get_registers {*|alt_jtag_atlantic*|td_shift[*]}]
set_false_path -from [get_registers {*|t_dav}] -to [get_registers {*|alt_jtag_atlantic:*|td_shift[0]*}]
set_false_path -from [get_registers {*|t_dav}] -to [get_registers {*|alt_jtag_atlantic:*|write_stalled*}]
set_false_path -from [get_registers {*|alt_jtag_atlantic:*|user_saw_rvalid}] -to [get_registers {*|alt_jtag_atlantic:*|rvalid0*}]
set_false_path -from [get_registers {*|alt_jtag_atlantic:*|wdata[*]}] -to [get_registers *]
set_false_path -from [get_registers {*|alt_jtag_atlantic:*|write_stalled}] -to [get_registers {*|alt_jtag_atlantic:*|t_ena*}]
set_false_path -from [get_registers {*|alt_jtag_atlantic:*|write_stalled}] -to [get_registers {*|alt_jtag_atlantic:*|t_pause*}]
set_false_path -from [get_registers {*|alt_jtag_atlantic:*|write_valid}] 
set_false_path -to [get_keepers {*altera_std_synchronizer:*|din_s1}]
set_false_path -from [get_keepers {*cpu:*|cpu_nios2_oci:the_cpu_nios2_oci|cpu_nios2_oci_break:the_cpu_nios2_oci_break|break_readreg*}] -to [get_keepers {*cpu:*|cpu_nios2_oci:the_cpu_nios2_oci|cpu_jtag_debug_module_wrapper:the_cpu_jtag_debug_module_wrapper|cpu_jtag_debug_module_tck:the_cpu_jtag_debug_module_tck|*sr*}]
set_false_path -from [get_keepers {*cpu:*|cpu_nios2_oci:the_cpu_nios2_oci|cpu_nios2_oci_debug:the_cpu_nios2_oci_debug|*resetlatch}] -to [get_keepers {*cpu:*|cpu_nios2_oci:the_cpu_nios2_oci|cpu_jtag_debug_module_wrapper:the_cpu_jtag_debug_module_wrapper|cpu_jtag_debug_module_tck:the_cpu_jtag_debug_module_tck|*sr[33]}]
set_false_path -from [get_keepers {*cpu:*|cpu_nios2_oci:the_cpu_nios2_oci|cpu_nios2_oci_debug:the_cpu_nios2_oci_debug|monitor_ready}] -to [get_keepers {*cpu:*|cpu_nios2_oci:the_cpu_nios2_oci|cpu_jtag_debug_module_wrapper:the_cpu_jtag_debug_module_wrapper|cpu_jtag_debug_module_tck:the_cpu_jtag_debug_module_tck|*sr[0]}]
set_false_path -from [get_keepers {*cpu:*|cpu_nios2_oci:the_cpu_nios2_oci|cpu_nios2_oci_debug:the_cpu_nios2_oci_debug|monitor_error}] -to [get_keepers {*cpu:*|cpu_nios2_oci:the_cpu_nios2_oci|cpu_jtag_debug_module_wrapper:the_cpu_jtag_debug_module_wrapper|cpu_jtag_debug_module_tck:the_cpu_jtag_debug_module_tck|*sr[34]}]
set_false_path -from [get_keepers {*cpu:*|cpu_nios2_oci:the_cpu_nios2_oci|cpu_nios2_ocimem:the_cpu_nios2_ocimem|*MonDReg*}] -to [get_keepers {*cpu:*|cpu_nios2_oci:the_cpu_nios2_oci|cpu_jtag_debug_module_wrapper:the_cpu_jtag_debug_module_wrapper|cpu_jtag_debug_module_tck:the_cpu_jtag_debug_module_tck|*sr*}]
set_false_path -from [get_keepers {*cpu:*|cpu_nios2_oci:the_cpu_nios2_oci|cpu_jtag_debug_module_wrapper:the_cpu_jtag_debug_module_wrapper|cpu_jtag_debug_module_tck:the_cpu_jtag_debug_module_tck|*sr*}] -to [get_keepers {*cpu:*|cpu_nios2_oci:the_cpu_nios2_oci|cpu_jtag_debug_module_wrapper:the_cpu_jtag_debug_module_wrapper|cpu_jtag_debug_module_sysclk:the_cpu_jtag_debug_module_sysclk|*jdo*}]
set_false_path -from [get_keepers {sld_hub:*|irf_reg*}] -to [get_keepers {*cpu:*|cpu_nios2_oci:the_cpu_nios2_oci|cpu_jtag_debug_module_wrapper:the_cpu_jtag_debug_module_wrapper|cpu_jtag_debug_module_sysclk:the_cpu_jtag_debug_module_sysclk|ir*}]
set_false_path -from [get_keepers {sld_hub:*|sld_shadow_jsm:shadow_jsm|state[1]}] -to [get_keepers {*cpu:*|cpu_nios2_oci:the_cpu_nios2_oci|cpu_nios2_oci_debug:the_cpu_nios2_oci_debug|monitor_go}]
set_false_path -from [get_pins -nocase -compatibility_mode {*the*clock*|slave_writedata_d1*|*}] -to [get_registers *]
set_false_path -from [get_pins -nocase -compatibility_mode {*the*clock*|slave_address*|*}] -to [get_registers *]
set_false_path -from [get_pins -nocase -compatibility_mode {*the*clock*|slave_byteenable*|*}] -to [get_registers *]
set_false_path -from [get_pins -nocase -compatibility_mode {*the*clock*|slave_nativeaddress_d1*|*}] -to [get_registers *]
set_false_path -from [get_pins -nocase -compatibility_mode {*the*clock*|slave_readdata_p1*}] -to [get_registers *]
set_false_path -from [get_keepers -nocase {*the*clock*|slave_readdata_p1*}] -to [get_registers *]


#**************************************************************
# Set Multicycle Path
#**************************************************************

set_multicycle_path -setup -end -from [get_registers {*|altera_tse_top_w_fifo:U_MAC|altera_tse_tx_min_ff:U_TXFF|altera_tse_altsyncram_dpm_fifo:U_RTSM|altsyncram*}] -to [get_registers *] 5
set_multicycle_path -setup -end -from [get_registers {*|altera_tse_top_w_fifo:U_MAC|altera_tse_tx_min_ff:U_TXFF|altera_tse_retransmit_cntl:U_RETR|*}] -to [get_registers *] 5
set_multicycle_path -setup -end -from [get_registers *] -to [get_registers {*|altera_tse_top_w_fifo:U_MAC|altera_tse_tx_min_ff:U_TXFF|altera_tse_retransmit_cntl:U_RETR|*}] 5
set_multicycle_path -hold -end -from [get_registers {*|altera_tse_top_w_fifo:U_MAC|altera_tse_tx_min_ff:U_TXFF|altera_tse_altsyncram_dpm_fifo:U_RTSM|altsyncram*}] -to [get_registers *] 5
set_multicycle_path -hold -end -from [get_registers {*|altera_tse_top_w_fifo:U_MAC|altera_tse_tx_min_ff:U_TXFF|altera_tse_retransmit_cntl:U_RETR|*}] -to [get_registers *] 5
set_multicycle_path -hold -end -from [get_registers *] -to [get_registers {*|altera_tse_top_w_fifo:U_MAC|altera_tse_tx_min_ff:U_TXFF|altera_tse_retransmit_cntl:U_RETR|*}] 5


#**************************************************************
# Set Maximum Delay
#**************************************************************

set_max_delay -from [get_registers {*|altera_tse_top_w_fifo:U_MAC|altera_tse_tx_min_ff:U_TXFF|dout_reg_sft*}] -to [get_registers {*|altera_tse_top_w_fifo:U_MAC|altera_tse_top_1geth:U_GETH|altera_tse_mac_tx:U_TX|*}] 7.000
set_max_delay -from [get_registers {*|altera_tse_top_w_fifo:U_MAC|altera_tse_tx_min_ff:U_TXFF|eop_sft*}] -to [get_registers {*|altera_tse_top_w_fifo:U_MAC|altera_tse_top_1geth:U_GETH|altera_tse_mac_tx:U_TX|*}] 7.000
set_max_delay -from [get_registers {*|altera_tse_top_w_fifo:U_MAC|altera_tse_tx_min_ff:U_TXFF|sop_reg*}] -to [get_registers {*|altera_tse_top_w_fifo:U_MAC|altera_tse_top_1geth:U_GETH|altera_tse_mac_tx:U_TX|*}] 7.000


#**************************************************************
# Set Minimum Delay
#**************************************************************



#**************************************************************
# Set Input Transition
#**************************************************************

